import { signal } from "@preact/signals-react";

export const ApiData = signal([
  {
    year_id: 2022,
    nameE: "الايرادات",
    nameM: "المصروفات",
    type: "column",
    dataE: [
      8000, 9000, 3000, 63000, 90000, 78000, 90500, 890000, 98050, 11000, 12080,
      10300,
    ], //.sort((a, b) => b - a),
    dataM: [
      38909, 40800, 20040, 50000, 49000, 400700, 60070, 81000, 90100, 6070,
      10200, 10100,
    ],
  },
  {
    year_id: 2023,
    nameE: "الايرادات",
    nameM: "المصروفات",
    type: "column",
    dataE: [
      80000, 50000, 30000, 630000, 900000, 700000, 905000, 8000000, 900050,
      110000, 120800, 103000,
    ], //.sort((a, b) => b - a),
    dataM: [
      389090, 408000, 200400, 500000, 490000, 400700, 600070, 810000, 900100,
      60070, 102000, 101000,
    ]
  },
]);



